DIS_PART = ['अग', 'ओम्', 'अ', 'अथ', 'अन', 'अनुकम्', 'अयत्', 'अप', 
        'अये', 'अलम्', 'अवयम्', 'अवस्', 'अतम्', 'अित', 'अह', 'अहह', 
        'अहो', 'आ', 'आः', 'आम्', 'आय', 'आयहलम्', 'आस्', 'आहो', 
        'इत', 'इत्', 'इध', 'इव', 'ईम्', 'ईषत्', 'उ', 'उच्चैस्', 'उत', 
        'उपांशु', 'उषा', 'ऋते', 'ऋधक्', 'एव', 'एवम्', 'कम्', 'कामम्', 
        'कतु', 'कुव', 'कूप', 'खलु', 'चत्', 'चरम्', 'चेत्', 'जोषम्', 
        'तथा', 'तावत्', 'तु', 'तूणीम्', 'दवा', 'धक्', 'न', 'नतम्', 'नञ्', 
        'ननु', 'नीचैस्', 'नु', 'नूनम्', 'नेत्', 'ने', 'नो', 'परम्', 'पृथक्', 
        'तान्', 'त', 'युत', 'बाहुकम्', 'वाहक', 'शान्', 'बत', 'बहस्', 'भूय', 
        'भूयसे', 'मनाक्', 'मा', 'मुध्', 'यथा', 'यद', 'यावत्', 'युगपत्', 'रा', 
        'रै', 'वत्', 'वद', 'वष', 'वा', 'वाव', 'वृथा', 'वै', 'वौष', 'शनैस्', 
        'शुकम्', 'समय', 'साकम्', 'साात्', 'साच', 'सायम्', 'साधम्', 'सीम्', 
        'सुद', 'वधा', 'वयम्', 'वित', 'ह', 'हत', 'हलम्', 'हा', 'हेतौ', 'य']


DISCOURSE_PARTICLES_DEP = ['उपमान_द्योतकः', 'कारण_द्योतकः', 'उत्प्रेक्षा_द्योतकः', 'उपमानम्_रहित_उपमान_द्योतकः', 'अन्यतर_द्योतकः']


DIS_CON_LIST = {
    ('यदि', 'तर्हि'): 'आवश्यकतापरिणाम',
    ('किन्तु', 'परन्तु'): 'विरोधी',
    ('च', 'अपि च', 'अथ च', 'किंच'): 'समुच्चय',
    ('अथवा', 'वा'): 'अन्यत्र',
    ('यद्यपि-तथापि', 'यद्यपि पुनरपि'): 'व्यभिचार',
    ('ततः', 'अनन्तरम्', 'तदनन्तरम्', 'अथ'): 'उत्तरकाल',
    ('इति कारणेन', 'यतोहि', 'यतः'): 'कार्यकारण',
    ('अतः', 'परिणामस्वरूपम्', 'तस्मात् कारणात्', 'एतस्मात् कारणात्'): 'परिणाम',
    ('अतिरिक्तम्', 'एतद् अतिरिक्तम्', 'एतद् अतिरिच्य'): 'समुच्चय.अतिरिक्त',
    ('अतिरिक्तम्'): 'समुच्चय.अलावा',
    ('न केवलम् अपितु'): 'समुच्चय.भी',
    ('सह एव', 'अनेन सह एव', 'तेन सह एव', 'एतेन सह एव'): 'समुच्चय.समावेशी',
    ('यदा तु'): 'विरोध.द्योतक',
    ('येन', 'यतः', 'यस्मात्', 'यस्मात् कारणात्'): 'कार्य.द्योतक',
    ('अन्येषु शब्देषु', 'अन्यशब्देषु', 'शब्दान्तरेषु'): 'अर्थात',
    ('यथा', 'उदाहरणस्वरूपम्', 'उदाहरणार्थम्'): 'उदाहरणस्वरूप',
}
